In [1]:
import sqlite3 as sql
import pandas as pd

In [2]:
# establish connection with db
# tables of the database: authors, author_ISBN, titles
connection = sql.connect("books.db")

In [6]:
pd.options.display.max_columns = 10
pd.read_sql('SELECT * FROM authors', connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald